Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties
Serialization structure for AnalysisPartLoadingProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationSelfWeight
This indicates whether selfweight load is generated.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._NumberOfLoadGenerationGroupIdentifier
The number of load generation group identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationGroupIdentifier
The load generation group identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._NumberOfLoadGenerationGroupFactors
The number of load generation group id factors.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationGroupFactors
The load generation group id factors.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationAutoCreateFixedSupports
This indicates wether fixed supports are automatically created.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationPartNamesInclude
This indicates whether part names are included in the load generation.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties._LoadGenerationPartNames
The load generation part names.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties.ToStruct(Tekla.Structures.Analysis.AnalysisPartLoadingProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartLoadingProperties.FromStruct(Tekla.Structures.Analysis.AnalysisPartLoadingProperties)
DO NOT USE! For internal usage only!
P: P.